/* Description of version prefixed with <Version:> */
"VERSION: %@" = "Versio: %@";

/* PGP preferences panel name */
"PGP_PREFERENCES" = "GPG Mail";

/* Message Error Banner messages. */
"MESSAGE_BANNER_PGP_DECRYPT_ERROR_TITLE" = "PGP-viestiä ei voitu purkaa.";
"MESSAGE_BANNER_PGP_DECRYPT_ERROR_MESSAGE" = "Viestin purkaminen epäonnistui. Varmista että sinulla on oikea avain avainrenkaassasi.";
"MESSAGE_BANNER_PGP_VERIFY_ERROR_TITLE" = "PGP-viestin allekirjoitusta ei voitu varmentaa.";
"MESSAGE_BANNER_PGP_VERIFY_ERROR_MESSAGE" = "PGP-allekirjoituksen lukeminen epäonnistui.";
"MESSAGE_BANNER_PGP_VERIFY_NOT_IN_KEYCHAIN_ERROR_TITLE" = "Avainrenkaassasi ei ole PGP-avainta tälle viestille.";
"MESSAGE_BANNER_PGP_VERIFY_NOT_IN_KEYCHAIN_ERROR_MESSAGE" = "Viestillä on PGP-allekirjoitus, mutta PGP-avainta ei ole avainrenkaassasi. Ole hyvä ja lisää se GPG Keychain.";
"MESSAGE_ERROR_ALERT_PGP_VERIFY_NOT_IN_KEYCHAIN_TITLE" = "Tästä PGP-avaimesta ei ole saatavilla tietoja.";
"MESSAGE_ERROR_ALERT_PGP_VERIFY_NOT_IN_KEYCHAIN_MESSAGE" = "Tästä PGP-avaimesta ei ole lisätietoja, koska se ei ole avainrenkaassasi.";

"MESSAGE_BANNER_PGP_DECRYPT_SECKEY_ERROR_TITLE" = "Viestin purkuun vaadittava salainen avain puuttuu.";
"MESSAGE_BANNER_PGP_DECRYPT_SECKEY_ERROR_MESSAGE" = "None of the following secret keys could be found in your keychain (%@). The secret key is needed to decrypt this message. \n\nPlease check with the sender that they used your correct public key.\nCheck any backup of your keychain, and try to import the secret key from there.";

"MESSAGE_BANNER_PGP_DECRYPT_SYSTEM_ERROR_TITLE" = "Salauksen purkaminen epäonnistui tuntemattoman virheen takia!";
"MESSAGE_BANNER_PGP_DECRYPT_SYSTEM_ERROR_MESSAGE" = "Tuntematon virhe salausta purettaessa.\n\nOle hyvä ja ota yhteyttä meihin osoitteessa https://gpgtools.tenderapp.com";

"MESSAGE_BANNER_PGP_DECRYPT_GENERAL_ERROR_TITLE" = "Salauksen purkaminen epäonnistui tuntemattoman virheen takia!";
"MESSAGE_BANNER_PGP_DECRYPT_GENERAL_ERROR_MESSAGE" = "Tuntematon virhe salausta purettaessa.\n\nGPG:n virheilmoitus:\n%@\nOle hyvä ja ota yhteyttä meihin osoitteessa https://gpgtools.tenderapp.com\nLiitä mukaan myös virheilmoituksen teksti.";

"MESSAGE_BANNER_PGP_DECRYPT_WRONG_SECKEY_ERROR_TITLE" = "Tämä viesti on salattu väärällä avaimella.";
"MESSAGE_BANNER_PGP_DECRYPT_WRONG_SECKEY_ERROR_MESSAGE" = "Viestiä ei voitu purkaa, koska se on salattu väärällä julkisella avaimella.\n\nOle hyvä ja ota yhteyttä meihin osoitteessa https://gpgtools.tenderapp.com";

"MESSAGE_BANNER_PGP_DECRYPT_CORRUPTED_DATA_ERROR_TITLE" = "Salattu viesti on vahingoittunut.";
"MESSAGE_BANNER_PGP_DECRYPT_CORRUPTED_DATA_ERROR_MESSAGE" = "Tämä salattu viesti on vahingoittunut eikä sitä voida purkaa.\n\nOle hyvä ja pyydä lähettäjää lähettämään viesti uudelleen.";

"MESSAGE_BANNER_PGP_VERIFY_REVOKED_CERTIFICATE_ERROR_TITLE" = "Allekirjoituksen avain on merkitty kumotuksi.";
"MESSAGE_BANNER_PGP_VERIFY_REVOKED_CERTIFICATE_ERROR_MESSAGE" = "Tämän viestin allekirjoitukseen käytetty avain on kumottu.\n\nTarkista GPG Keychain - ohjelmalla onko avainta (ID %@) uusittu. Jos avain on edelleen kumottu, on syytä tarkistaa lähettäjältä kumoamisen syy ja suhtautua viestiin varovaisuudella siihen asti.";
"MESSAGE_BANNER_PGP_VERIFY_NO_PUBKEY_ERROR_TITLE" = "Tämän allekirjoituksen avainta ei ole avainrenkaassasi.";
"MESSAGE_BANNER_PGP_VERIFY_NO_PUBKEY_ERROR_MESSAGE" = "Viestiä ei voida varmentaa, koska sen allekirjoitukseen käytettyä avainta ei löydy avainnipustasi.\n\nNouda ja tuo avain (ID %@) GPG Keychain - ohjelmalla ja yritä sitten uudelleen.";

"MESSAGE_BANNER_PGP_VERIFY_ALGORITHM_ERROR_TITLE" = "Tämä allekirjoitus on luotu käyttäen algoritmiä jota ei tueta.";
"MESSAGE_BANNER_PGP_VERIFY_ALGORITHM_ERROR_MESSAGE" = "Viestiä ei pystytä varmentamaan, koska allekirjoitus on luotu käyttäen algoritmia, jota ei tueta.";

"MESSAGE_BANNER_PGP_VERIFY_BAD_SIGNATURE_ERROR_TITLE" = "HUOMIO: Tämän viestin allekirjoitus on virheellinen!";
"MESSAGE_BANNER_PGP_VERIFY_BAD_SIGNATURE_ERROR_MESSAGE" = "This message might have been modified after the signature was created.\n\nPlease contact the sender to make sure the content of the message matches the original.\n\nPlease contact us at\nhttps://gpgtools.tenderapp.com/\nif you're sure the message was not modified.";

"MESSAGE_BANNER_PGP_VERIFY_SYSTEM_ERROR_TITLE" = "Allekirjoituksen varmistus epäonnistui tuntemattoman virheen takia.";
"MESSAGE_BANNER_PGP_VERIFY_SYSTEM_ERROR_MESSAGE" = "Tuntematon virhe havaittu viestin allekirjoitusta varmennettaessa.\n\nOle hyvä ja ota yhteyttä meihin osoitteessa https://gpgtools.tenderapp.com";

"MESSAGE_BANNER_PGP_VERIFY_CORRUPTED_DATA_ERROR_TITLE" = "Viestin allekirjoitus on vaurioitunut!";
"MESSAGE_BANNER_PGP_VERIFY_CORRUPTED_DATA_ERROR_MESSAGE" = "Tämän viestin allekirjoitus on virheellinen eikä sitä pystytä varmentamaan.\n\nOle hyvä ja ota yhteyttä meihin osoitteessa https://gpgtools.tenderapp.com";

"MESSAGE_BANNER_PGP_VERIFY_KEY_EXPIRED_ERROR_TITLE" = "Allekirjoituksen avain on vanhentunut.";
"MESSAGE_BANNER_PGP_VERIFY_KEY_EXPIRED_ERROR_MESSAGE" = "Avain, jolla viesti on allekirjoitettu, on vanhentunut.\n\nVoit yrittää ladata avaimen uudelleen, tunnistetiedon ID %@ kanssa,  avainrenkaastasi ja kysyä lähettäjältä vanhentuneen avaimen syytä.";

"MESSAGE_BANNER_PGP_VERIFY_SIGNATURE_EXPIRED_ERROR_TITLE" = "Allekirjoitus on vanhentunut.";
"MESSAGE_BANNER_PGP_VERIFY_SIGNATURE_EXPIRED_ERROR_MESSAGE" = "Allekirjoitus on vanhentunut eikä sitä voida varmentaa.\n\nKysy viestin lähettäjältä syytä vanhentuneeseen allekirjoitukseen";

"MESSAGE_BANNER_PGP_DECRYPT_ERROR_NO_GPG_TITLE" = "MacGPG is not installed";
"MESSAGE_BANNER_PGP_DECRYPT_ERROR_NO_GPG_MESSAGE" = "Decrypting failed because MacGPG is not installed.\n\nPlease download and re-install GPG Suite from https://gpgtools.org";

"MESSAGE_BANNER_PGP_VERIFY_ERROR_NO_GPG_TITLE" = "MacGPG is not installed";
"MESSAGE_BANNER_PGP_VERIFY_ERROR_NO_GPG_MESSAGE" = "Verifying failed because MacGPG is not installed.\n\nPlease download and re-install GPG Suite from https://gpgtools.org";

"MESSAGE_BANNER_PGP_ATTACHMENTS_DECRYPT_VERIFY_ERROR_TITLE" = "%d liitteen salauksen purku tai allekirjoituksen varmistus epäonnistui.";
"MESSAGE_BANNER_PGP_ATTACHMENTS_DECRYPT_VERIFY_ERROR_MESSAGE" = "Ole hyvä ja paina liitekuvaketta otsakkeen turvallisuusosassa saadaksesi lisätietoja.";

"MESSAGE_BANNER_PGP_ATTACHMENTS_VERIFY_ERROR_TITLE" = "%d liitteen allekirjoituksen varmistus epäonnistui.";
"MESSAGE_BANNER_PGP_ATTACHMENTS_VERIFY_ERROR_MESSAGE" = "Ole hyvä ja paina liitekuvaketta otsakkeen turvallisuusosassa saadaksesi lisätietoja.";

"MESSAGE_BANNER_PGP_ATTACHMENTS_DECRYPT_ERROR_TITLE" = "%d liitteen salauksen purku epäonnistui.";
"MESSAGE_BANNER_PGP_ATTACHMENTS_DECRYPT_ERROR_MESSAGE" = "Ole hyvä ja paina liitekuvaketta otsakkeen turvallisuusosassa saadaksesi lisätietoja.";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_ERROR_TITLE" = "%d liitteen allekirjoituksen varmistus epäonnistui.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_ERROR_MESSAGE" = "Ole hyvä ja paina liitekuvaketta otsakkeen turvallisuusosassa saadaksesi lisätietoja.";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_TITLE" = "%d liitteen salauksen purku epäonnistui.";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_MESSAGE" = "Ole hyvä ja paina liitekuvaketta otsakkeen turvallisuusosassa saadaksesi lisätietoja.";

/* Message Error Banner Attachment messages. */
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_SECKEY_ERROR_TITLE" = "Liitteen salauksen purkamiseen tarvittavaa salaista avainta ei löydy.";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_SECKEY_ERROR_MESSAGE" = "None of the following secret keys could be found in your keychain (%@). The secret key is needed to decrypt this attachment. \n\nPlease check with the sender that they used your correct public key.\nCheck any backup of your keychain, and try to import the secret key from there.";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_SYSTEM_ERROR_TITLE" = "Salauksen purkaminen epäonnistui tuntemattoman virheen takia!";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_SYSTEM_ERROR_MESSAGE" = "Tuntematon virhe ilmeni liitteen salausta purkaessa.\n\nOle hyvä ja ota yhteyttä https://gpgtools.tenderapp.com/";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_GENERAL_ERROR_TITLE" = "Salauksen purkaminen epäonnistui tuntemattoman virheen takia!";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_GENERAL_ERROR_MESSAGE" = "Tuntematon virhe ilmeni liitteen salausta purkaessa.\n\nGPG virheviesti:\n%@\nOle hyvä ja ota yhteyttä, https://gpgtools.tenderapp.com/ ja liitä virheviesti mukaan";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_WRONG_SECKEY_ERROR_TITLE" = "Liitteen avaamiseen käytetty väärää avainta.";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_WRONG_SECKEY_ERROR_MESSAGE" = "Liitteen salausta ei pystytty purkamaan, koska väärää avainta on käytetty sen salaamiseksi.\n\nOle hyvä ja ota yhteyttä, https://gpgtools.tenderapp.com/";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_CORRUPTED_DATA_ERROR_TITLE" = "Salattu liitetiedosto on vaurioitunut.";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_CORRUPTED_DATA_ERROR_MESSAGE" = "Salattu liite on vioittunut ja salausta ei voida purkaa.\n\nPyydä lähettäjää lähetämään viesti uudestaan.";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_REVOKED_CERTIFICATE_ERROR_TITLE" = "Allekirjoituksen avain on merkitty kumotuksi.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_REVOKED_CERTIFICATE_ERROR_MESSAGE" = "The key which was used to sign this attachment was revoked.\n\nYou should refresh the key with key ID %@ in GPG Keychain to check if a new one is available. If the new one is still revoked, check with the sender why the key was revoked.";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_NO_PUBKEY_ERROR_TITLE" = "Allekirjoituksen avain ei ole avainrenkaassasi.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_NO_PUBKEY_ERROR_MESSAGE" = "The attachment signature could not be verified, since the key which was used to sign is not in your GPG Keychain.\n\nSearch for the key with ID %@ in GPG Keychain and import it to verify the attachment.";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_ALGORITHM_ERROR_TITLE" = "Liitteen allekirjoitus on luotu käyttämällä algoritmia, jota ei tueta.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_ALGORITHM_ERROR_MESSAGE" = "Liitettä ei voitu varmentaa, koska allekirjoitukseen käytetty avain on luotu käyttäen suojausalgoritmia jota ei tueta.\n\nOle hyvä ja ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_BAD_SIGNATURE_ERROR_TITLE" = "HUOMIO: Liitteen allekirjoitus on epäkelpo.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_BAD_SIGNATURE_ERROR_MESSAGE" = "This attachment might have been modified after the signature was created.\n\nPlease contact the sender and make sure the content of the attachment matches the original.\n\nPlease contact us at\nhttps://gpgtools.tenderapp.com/\n if you're sure the attachment was not modified.";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_SYSTEM_ERROR_TITLE" = "Allekirjoituksen varmentaminen epäonnistui tuntemattomasta virheestä johtuen!";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_SYSTEM_ERROR_MESSAGE" = "An unknown error occurred while verifying this attachment signature.\n\nPlease contact us at https://gpgtools.tenderapp.com/";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_CORRUPTED_DATA_ERROR_TITLE" = "Allekirjoitus on vaurioitunut!";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_CORRUPTED_DATA_ERROR_MESSAGE" = "Liitetteen allekirjoitus on epäkelpo eikä sitä voitu varmentaa.\n\nOle hyvä ja ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_KEY_EXPIRED_ERROR_TITLE" = "Allekirjoituksen avain on vanhentunut.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_KEY_EXPIRED_ERROR_MESSAGE" = "The key which was used to sign this attachment is expired.\n\nYou can try to refresh the key with ID %@ in GPG Keychain and ask the sender why the key is expired.";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_SIGNATURE_EXPIRED_ERROR_TITLE" = "Liitteen allekirjoitus on vanhentunut.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_SIGNATURE_EXPIRED_ERROR_MESSAGE" = "The attachment signature is expired and could not be verified.\n\nAsk the sender why the signature is expired.";

"MESSAGE_IS_PGP_PARTLY_ENCRYPTED" = "Osittain salattu";
"MESSAGE_IS_PGP_PARTLY_SIGNED" = "Osittain allekirjoitettu";
"MESSAGE_IS_PGP_ENCRYPTED" = "Salattu";
"MESSAGE_IS_PGP_SIGNED" = "Allekirjoitettu";
"MESSAGE_IS_PGP_SIGNED_INVALID" = "Virheellinen allekirjoitus";

/* Security Header signature related. */
"MESSAGE_SECURITY_HEADER_SIGNATURE_NO_PUBLIC_KEY_TITLE" = "Allekirjoitettu tuntemattomalla avaimella";
"MESSAGE_SECURITY_HEADER_SIGNATURE_REVOKED_TITLE" = "Allekirjoitettu kumotulla avaimella";
"MESSAGE_SECURITY_HEADER_SIGNATURE_BAD_TITLE" = "Virheellinen allekirjoitus";
"MESSAGE_SECURITY_HEADER_SIGNATURE_TITLE" = "Allekirjoitettu";
"MESSAGE_SECURITY_HEADER_NO_SIGNATURE_TITLE" = "Allekirjoitusta ei löydy.";

/* Security header attachments related. */
"MESSAGE_SECURITY_HEADER_ATTACHMENT_SIGNED_ENCRYPTED_TITLE" = "Salattu/allekirjoitettu liitetiedosto";
"MESSAGE_SECURITY_HEADER_ATTACHMENTS_SIGNED_ENCRYPTED_TITLE" = "Salattuja/allekirjoitettuja liitetiedostoja";
"MESSAGE_SECURITY_HEADER_ATTACHMENT_ENCRYPTED_TITLE" = "Salattu liitetiedosto";
"MESSAGE_SECURITY_HEADER_ATTACHMENTS_ENCRYPTED_TITLE" = "Salattuja liitetiedostoja";
"MESSAGE_SECURITY_HEADER_ATTACHMENT_SIGNED_TITLE" = "Allekirjoitettu liitetiedosto";
"MESSAGE_SECURITY_HEADER_ATTACHMENTS_SIGNED_TITLE" = "Allekirjoitettuja liitetiedostoja";

/* Compose Window encrypt/sign button tooltips. */
"COMPOSE_WINDOW_TOOLTIP_CAN_NOT_PGP_SIGN" = "This message can't be signed, since there's no secret key for %@.\n\nPlease make sure that a secret key for this address exists in GPG Keychain. Add a new User ID to an existing key for this address if necessary, or create a new key for this address.\n\nIf a key for the address exists, make sure that the address in Mail.app > Preferences > Accounts is correct and exactly matches the address of your key.";
"COMPOSE_WINDOW_TOOLTIP_CAN_NOT_PGP_ENCRYPT" = "Viestiä ei pystytä salaamaan, koska osoitteille %@ ei ole yhtään julkista avainta.\n\nOle hyvä ja etsi GPG avainrenkaasta oikea avain ja liitä se osoiteeseen.";
"COMPOSE_WINDOW_TOOLTIP_CAN_NOT_PGP_ENCRYPT_NO_RECIPIENTS" = "Viestiä ei pystytä salaamaan. Sinun täytyy valita vähintään yksi vastaanottaja ensiksi.";

/* Message view pgp part. */
"MESSAGE_VIEW_PGP_PART_ENCRYPTED" = "Salattu";
"MESSAGE_VIEW_PGP_PART_SIGNED" = "Allekirjoitettu";
"MESSAGE_VIEW_PGP_PART" = "PGP-osa";

/* GPG Mail Preferences strings. */
"GPG_STATUS_NO_ERROR_TITLE" = "GPG Mail ready";
"GPG_STATUS_NOT_FOUND_TITLE" = "MacGPG not found, reinstall GPG Suite";
"GPG_STATUS_NOT_FOUND_TOOLTIP" = "Click indicator bubble for further information";
"GPG_STATUS_OTHER_ERROR_TITLE" = "Problems found, click indicator bubble for more info";
"GPG_STATUS_OTHER_ERROR_TOOLTIP" = "Click indicator bubble for further information";

"DISABLE_ENCRYPT_DRAFTS_TITLE" = "Varoitus: Tämän toiminnan pois päältä kytkeminen voi mahdollistaa arkaluonteisen tiedon vuotamisen uutta viestiä luodessa.";
"DISABLE_ENCRYPT_DRAFTS_MESSAGE" = "If the option \"Store drafts on server\" is enabled for your accounts, macOS Mail automatically stores your drafts on your mail server while you're composing a message.\nBy disabling \"Encrypt drafts\", your drafts will be stored in plain text (not encrypted) so that anyone with access to the mail server can read them.\n\nIf you keep \"Encrypt drafts\" enabled, your drafts will be encrypted before they are stored on a mail server and only you will be able to read them.\n\nDo you still want to disable \"Encrypt drafts\"?";
"DISABLE_ENCRYPT_DRAFTS_CONFIRM" = "Kytke salaus pois";
"DISABLE_ENCRYPT_DRAFTS_CANCEL" = "Peruuta";


/* Multiple GPG Mail installations. */
"GPGMAIL_MULTIPLE_INSTALLATIONS_TITLE" = "Aikaisempia GPG Mail-asennuksia havaittu!";
"GPGMAIL_MULTIPLE_INSTALLATIONS_MESSAGE" = "GPG Mail detected multiple installations in the following locations which will lead to an immediate crash:\n\n%@\n\nPlease remove the GPGMail.mailbundle in one of the locations and restart Mail.\n";
"GPGMAIL_MULTIPLE_INSTALLATIONS_BUTTON" = "Poistu ohjelmasta";

/* No Libmacgpg. */
"LIBMACGPG_NOT_FOUND_TITLE" = "Libmacgpg -kirjastoa ei löydy";
"LIBMACGPG_NOT_FOUND_MESSAGE" = "Libmacgpg was not found on your system. Please download and install GPG Suite from https://www.gpgtools.org.";

/* Code signature invalid */
CODE_SIGN_ERROR_TITLE = "Joku peruutti GPG Mail-ohjelman asennuksesi!";
CODE_SIGN_ERROR_MESSAGE = "To keep you safe, GPG Mail will not be loaded!\n\nPlease re-install GPG Suite from https://gpgtools.org to be sure you have an original version from us!";

/* GPGMailGPGMailBundle.defaults can't be loaded */
NO_DEFAULTS_TITLE = "GPG Mail -ohjelman oletusasetuksia ei pystytty lataamaan!";
NO_DEFAULTS_MESSAGE = "GPG Mail ei toimi odotetusti.\n\nOle hyvä ja asenna GPG Suite uudelleen, osoitteesta https://gpgtools.org.\n\nJos ongelma jatkuu, ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com.";

/* Errors while trying to sign a message. */
"MESSAGE_SIGNING_ERROR_NO_PINENTRY_TITLE" = "Viestin allekirjoitus epäonnistui, koska avaintunnuslauseen kysely ei toimi.";
"MESSAGE_SIGNING_ERROR_NO_PINENTRY_DESCRIPTION" = "Avaintunnuslauseen kyselytoiminne on rikki. Jos ongelma jatkuu, voit koettaa uudelleenasentaa GPG Suite -ohjelmiston osoitteesta https://gpgtools.org.";

"MESSAGE_SIGNING_ERROR_NO_AGENT_TITLE" = "Signing your message failed due to defect GPG agent!";
"MESSAGE_SIGNING_ERROR_NO_AGENT_DESCRIPTION" = "The GPG agent which is a crucial part of GPG seems to be broken.\n\nTo fix this problem, re-install GPG Suite from https://gpgtools.org.";

"MESSAGE_SIGNING_ERROR_AGENT_ERROR_TITLE" = "Signing your message failed due to GPG agent communication error!";
"MESSAGE_SIGNING_ERROR_AGENT_ERROR_DESCRIPTION" = "It was not possible to talk to the GPG agent in order to request your password.\n\nTo fix this problem, re-install GPG Suite from https://gpgtools.org.";

"MESSAGE_SIGNING_ERROR_UNKNOWN_ERROR_TITLE" = "Viestin allekirjoitus epäonnistui tuntemattoman virheen takia";
"MESSAGE_SIGNING_ERROR_UNKNOWN_ERROR_DESCRIPTION" = "Unfortunately GPG Mail can't handle the error at this point.";

"MESSAGE_ENCRYPTION_ERROR_UNKNOWN_ERROR_TITLE" = "Encrypting your message failed because an unknown error has occured";
"MESSAGE_ENCRYPTION_ERROR_UNKNOWN_ERROR_DESCRIPTION" = "Unfortunately GPG Mail can't handle the error at this point.";

"MESSAGE_SIGNING_ERROR_WRONG_PASSPHRASE_TITLE" = "Annoit väärän salasanan liian monta kertaa.";
"MESSAGE_SIGNING_ERROR_WRONG_PASSPHRASE_DESCRIPTION" = "Signing your message was aborted because you entered the wrong password 3 times.";

"CONTACT_GPGTOOLS_WITH_INFO_MESSAGE" = "\n\nShould your problem persist, please contact us at https://gpgtools.tenderapp.com/ with the following error description:\n\n%@";

"MESSAGE_BANNER_PGP_DECRYPT_ERROR_PASSPHRASE_REQUEST_CANCELLED_TITLE" = "You aborted the decryption of the message";
"MESSAGE_BANNER_PGP_DECRYPT_ERROR_PASSPHRASE_REQUEST_CANCELLED_MESSAGE" = "The message couldn't be decrypted because you cancelled the password request.";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_PASSPHRASE_REQUEST_CANCELLED_TITLE" = "You aborted the decryption of the attachment";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_PASSPHRASE_REQUEST_CANCELLED_MESSAGE" = "Liitteen salausta ei purettu koska peruit salasanakyselyn.";

"MESSAGE_BANNER_PGP_DECRYPT_ERROR_XPC_DAMAGED_TITLE" = "GPG Suite ei toimi odotetulla tavalla.";
"MESSAGE_BANNER_PGP_DECRYPT_ERROR_XPC_DAMAGED_MESSAGE" = "Viestin salauksen purku epäonnistui.\n\nOle hyvä ja asenna GPG Suite uudelleen, osoitteesta https://gpgtools.org.\n\nJos ongelma jatkuu, ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com ja anna ongelmaraportissa tieto \"xpc service is not working properly\".";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_XPC_DAMAGED_TITLE" = "GPG Suite ei toimi odotetulla tavalla.";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_XPC_DAMAGED_MESSAGE" = "Liitteen salauksen purku epäonnistui.\n\nOle hyvä ja asenna GPG Suite uudelleen, osoitteesta https://gpgtools.org.\n\nJos ongelma jatkuu, ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com ja anna ongelmaraportissa tieto \"xpc service is not working properly\".";

"MESSAGE_BANNER_PGP_VERIFY_ERROR_XPC_DAMAGED_TITLE" = "GPG Suite ei toimi odotetulla tavalla.";
"MESSAGE_BANNER_PGP_VERIFY_ERROR_XPC_DAMAGED_MESSAGE" = "Viestin varmennus epäonnistui.\n\nOle hyvä ja asenna GPG Suite uudelleen, osoitteesta https://gpgtools.org.\n\nJos ongelma jatkuu, ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com ja anna ongelmaraportissa tieto \"xpc service is not working properly\".";

"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_ERROR_XPC_DAMAGED_TITLE" = "GPG Suite ei toimi odotetulla tavalla.";
"MESSAGE_BANNER_PGP_ATTACHMENT_VERIFY_ERROR_XPC_DAMAGED_MESSAGE" = "Liitteen varmennus epäonnistui.\n\nOle hyvä ja asenna GPG Suite uudelleen, osoitteesta https://gpgtools.org.\n\nJos ongelma jatkuu, ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com ja anna ongelmaraportissa tieto \"xpc service is not working properly\".";

"MESSAGE_SIGNING_ERROR_PINENTRY_CRASH_TITLE" = "Viestin allekirjoitus epäonnistui salasanakyselyn aikana ilmenneen ongelman takia.";
"MESSAGE_SIGNING_ERROR_PINENTRY_CRASH_DESCRIPTION" = "Avaintunnuslauseen kysely ei toimi. Jos ongelma jatkuu, kokeile uudelleenasentaa GPG Suite - ohjelmisto osoitteesta https://gpgtools.org";

"MESSAGE_SIGNING_ERROR_XPC_DAMAGED_TITLE" = "Viestin allekirjoitus epäonnistui rikkinäisen GPG Mail-asennuksen takia.";
"MESSAGE_SIGNING_ERROR_XPC_DAMAGED_DESCRIPTION" = "Korjaa ongelma asentamalla GPG Suite uudelleen, osoitteesta https://gpgtools.org.\n\nJos ongelma jatkuu, ota yhteyttä tukipalveluun osoitteessa  https://gpgtools.tenderapp.com ja anna ongelmaraportissa tieto \"xpc service is not working properly\".";

"MESSAGE_BANNER_PGP_DECRYPT_ERROR_PINENTRY_CRASHED_TITLE" = "Viestin salauksen purku epäonnistui, koska avaintunnuslauseen kysely ei toimi.";
"MESSAGE_BANNER_PGP_DECRYPT_ERROR_PINENTRY_CRASHED_MESSAGE" = "Avaintunnuslauseen kyselytoiminne on rikki. Jos ongelma jatkuu, voit koettaa uudelleenasentaa GPG Suite -ohjelmiston osoitteesta https://gpgtools.org.";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_PINENTRY_CRASHED_TITLE" = "Viestin salauksen purku epäonnistui, koska avaintunnuslauseen kyselyssä on virhe.";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_ERROR_PINENTRY_CRASHED_MESSAGE" = "Avaintunnuslauseen kyselytoiminne on rikki. Jos ongelma jatkuu, voit koettaa uudelleenasentaa GPG Suite -ohjelmiston osoitteesta https://gpgtools.org.";

"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_TITLE" = "Huomio: Olet lähettämässä, salattuun viestiin, salaamatonta vastausta.";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_MISSING_KEYS_SINGULAR" = "Vastausta ei voida salata, koska ao. vastaanottajan julkista avainta ei löydy: \n\n%@";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_MISSING_KEYS" = "Vastausta ei voida salata, koska ao. vastaanottajien julkisia avaimia ei löydy: \n\n%@";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_EXPLANATION" = "Jos jatkat, vastauksesi lähetetään salaamattomana ja sen sisältö on tietovuodon sattuessa suojaton. Suojattoman viestin tietojen väärinkäytöstä voi koitua haittaa sinulle, viestin vastaanottajalle ja/tai muille asianosaisille.";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_SOLUTION_REMOVE_PREVIOUS_CORRESPONDENCE" = "\n\nJos todellakin haluat lähettää vastauksen salaamattomana, ole hyvä ja jätä vastauksesta pois aiempi (salattu) kirjeenvaihto.";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_SOLUTION_IMPORT_KEYS" = "Muussa tapauksessa, nouda vastaavat julkiset avaimet GPG Keychain -ohjelmaan salataksesi vastauksen.";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_SOLUTION_IMPORT_KEYS_SINGULAR" = "Otherwise, search and import the corresponding public key using GPG Keychain in order to send the reply encrypted.";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_BUTTON_SEND_ANYWAY" = "Lähetä joka tapauksessa";
"UNENCRYPTED_REPLY_TO_ENCRYPTED_MESSAGE_BUTTON_CANCEL" = "Peruuta";

"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_TITLE" = "Attention: You're about to forward the decrypted version of an encrypted message";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_MISSING_KEYS_SINGULAR" = "It's not possible to encrypt the message you are about to forward, because the public key for the following recipient is missing:\n\n%@";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_MISSING_KEYS" = "It's not possible to encrypt the message you are about to forward, because public keys for the following recipients are missing:\n\n%@";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_EXPLANATION" = "If you choose to proceed, the message you are about to forward will be sent unencrypted. As a result, confidential information might be leaked, putting you and your recipients at risk.";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_SOLUTION_IMPORT_KEYS" = "Otherwise, search and import the corresponding public keys using GPG Keychain in order to forward an encrypted version of the message.";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_SOLUTION_IMPORT_KEYS_SINGULAR" = "Otherwise, search and import the corresponding public key using GPG Keychain in order to forward an encrypted version of the message.";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_BUTTON_SEND_ANYWAY" = "Forward Anyway";
"UNENCRYPTED_FORWARD_OF_ENCRYPTED_MESSAGE_BUTTON_CANCEL" = "Peruuta";

"MESSAGE_BANNER_PGP_DECRYPT_MDC_ERROR_TITLE" = "Decryption of the message was aborted";
"MESSAGE_BANNER_PGP_DECRYPT_MDC_ERROR_MESSAGE" = "The modification detection code (MDC) for this encrypted message is missing or has been modified.\n\nThis could mean that an attacker has been trying to modify the contents within the encrypted message.\n\nPlease have the message re-sent to you and tell the sender, that their encrypted message didn't include a modification detection code.";

"NAVIGATION_ACTION_FROM_ENCRYPTED_MESSAGE_TITLE" = "Attention: Opening this website could leak the contents of this message";
"NAVIGATION_ACTION_FROM_ENCRYPTED_MESSAGE_MESSAGE" = "Due to a problem in the implementation of S/MIME encryption, it is possible for an attacker to modify a message without your knowledge.\n\nYou are about to open the following website:\n\n%@\n\nAre you sure you want to continue?";
"NAVIGATION_ACTION_FROM_ENCRYPTED_MESSAGE_BUTTON_YES" = "Yes";
"NAVIGATION_ACTION_FROM_ENCRYPTED_MESSAGE_BUTTON_CANCEL" = "Peruuta";

"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_MDC_ERROR_TITLE" = "Decryption of the attachment was aborted";
"MESSAGE_BANNER_PGP_ATTACHMENT_DECRYPT_MDC_ERROR_MESSAGE" = "The modification detection code (MDC) for this encrypted attachment is missing or has been modified.\n\nThis could mean that an attacker has been trying to modify the contents within the encrypted attachment.\n\nPlease have the attachment re-sent to you and tell the sender, that their encrypted attachment didn't include a modification detection code.";


/* Accessibility */
ACCESSIBILITY_SECURITY_METHOD_POPUP_LABEL = "Suojaustapa: %@";
ACCESSIBILITY_SIGN_ON_IMAGE = "Allekirjoita";
ACCESSIBILITY_SIGN_OFF_IMAGE = "Älä allekirjoita";



/* Support Plan */
"SUPPORT_PLAN_ACTIVATION_SUCCESS_TITLE" = "Support Plan Activated";
"SUPPORT_PLAN_ACTIVATION_SUCCESS_MESSAGE" = "Thank you for your support!\n\nWe hope you enjoy using GPG Mail. Should you have any questions, don't hesitate to contact us via \"Report Problem\" in Mail › Preferences › GPG Mail";
"SUPPORT_PLAN_ACTIVATION_FAILED_TITLE" = "Support Plan Activation Failed";
"SUPPORT_PLAN_ACTIVATION_FAILED_INPUT_INVALID" = "The entered activation code is invalid. Please check the entered information and try again.";
"SUPPORT_PLAN_ACTIVATION_FAILED_CONNECTTION_ERROR" = "We were unable to connect to the paddle.com API to verify your activation code.\nIf you are using any macOS firewall product (buil-in firewall, Little Snitch, etc.), please allow connections to paddle.com for the activation to complete. You can block any connections again once the activation is completed.\n\nPlease contact us at business@gpgtools.org if the problem persists.";
"SUPPORT_PLAN_ACTIVATION_FAILED_CODE_INVALID" = "The entered activation code is invalid.\nPlease contact us at business@gpgtools.org if you are sure that you have entered your code correctly.";
"SUPPORT_PLAN_ACTIVATION_FAILED_TOO_MANY_ACTIVATIONS" = "We are very sorry to inform you that you have exceeded the allowed number of activations.\nPlease contact us at business@gpgtools.org, if you believe that you should still have activations left.";
"SUPPORT_PLAN_ACTIVATION_FAILED_GENERAL_ERROR" = "Unfortunately an unknown error has occurred. Please retry later or use 'System Preferences › GPG Suite › Send Report' to contact us";
"SUPPORT_PLAN_HEADER_EXPIRED" = "Your 30-day-trial of GPG Mail has expired. Encrypting, signing and verifying messages will stop to work. Decrypting however will always continue to work.\nPurchase GPG Mail Support Plan to continue with full functionality.";
"SUPPORT_PLAN_HEADER_TRIAL" = "You can test GPG Mail free for %@ days.\nSecure your emails now!";
"SUPPORT_PLAN_HEADER_TRIAL_MORE" = "You can test GPG Mail free for %@ more days.\nSecure your emails now!";
"SUPPORT_PLAN_DETAILS_MESSAGE" = "If you have already purchased a support plan, activate it now and enjoy GPG Mail!";
"SUPPORT_PLAN_DETAILS_MESSAGE_HYPERLINK_PART" = "support plan";
"SUPPORT_PLAN_BUY" = "Buy Now";
"SUPPORT_PLAN_CLOSE" = "Continue";
"SUPPORT_PLAN_CONTINUE_TRIAL"= "Continue Trial";
"SUPPORT_PLAN_START_TRIAL" = "Start Trial";
"SUPPORT_PLAN_BUY" = "Buy Now";
"SUPPORT_PLAN_ACTIVATE" = "Activate";
"SUPPORT_PLAN_TRIAL_EXPIRED_TITLE" = "GPG Mail Trial Expired";
"SUPPORT_PLAN_TRIAL_EXPIRED_MESSAGE" = "Without an active GPG Mail Support Plan you will still be able to read any of your encrypted emails. However, you will no longer be able to sign, encrypt or verify emails.";
"SUPPORT_PLAN_HEADER_WELCOME" = "Welcome to GPG Mail";
"SUPPORT_PLAN_EMAIL_LABEL" = "Email";
"SUPPORT_PLAN_LICENSE_LABEL" = "Activation Code";
"SUPPORT_PLAN_GRAY_INFO" = "Your activation code can be found in the email you receive after completing your purchase.";
"SUPPORT_PLAN_PROGRESS_LABEL" = "Activating your copy of GPG Mail";






